import 'package:flutter/widgets.dart';

/// *
/// @Date: 2022-06-07 11:35
/// @LastEditTime: 2022-06-15 15:32
/// @Description: 常量
class FinalKeys {
  //////网络------------------------------

  //环境
  static const bool environment = true;

  static String baseServer() {
    if (environment) {
      //正式
      return "https://api.nowcheck.cn";
    } else {
      //测试
      return "http://api.dev.nowcheck.cn";
    }
  }

  static String alipayReturnBuycoin() {
    if (environment) {
      //正式
      return "https://m.nowcheck.cn/assetManagement";
    } else {
      //测试
      return "https://m.dev.nowcheck.cn/assetM/**/anagement";
    }
  }

  static String alipayReturn() {
    if (environment) {
      //正式
      return "https://m.nowcheck.cn/payResults";
    } else {
      //测试
      return "https://m.dev.nowcheck.cn/payResults";
    }
  }

  static String umengAndroidAppkey() {
    if (environment) {
      //正式
      return "6435119bba6a5259c4358dd6";
    } else {
      //测试
      return "64d49039a1a164591b678479";
    }
  }

  static String umengIosAppkey() {
    if (environment) {
      //正式
      return "64351369ba6a5259c43595c3";
    } else {
      //测试
      return "64d490afa1a164591b6784ff";
    }
  }

  //HUAWEI
  //VIVO
  //BAIDU
  //OPPO？？
  //MILLET
  //TENCENT

  //TEST
  //UPDATE
  static const String umengChannel = "BAIDU";

  ///连接超时时间
  static const int CONNECT_TIME_OUT = 60 * 1000;

  ///回复超时时间
  static const int RECEIVE_TIME_OUT = 60 * 1000;

  ///是否开启代理
  static const bool PROXY_ENABLE = false;

  ///代理地址
  static const String CAUGHT_ADDRESS = "";

  //////支付-----------------------------

  ///支付宝APPID
  static const String ALIAPPID = "2021003122631129";

  //////native-----------------------------
  ///给native发消息，此处应和客户端名称保持一致
  static const String NATIVE_CHANNEL_PAY = "com.flutter.native";

  ///给Flutter发消息，此处应和客户端名称保持一致
  static const String FLUTTER_CHANNEL_PAY = "com.native.flutter";

  //////UI------------------------------
  ///设计尺寸
  static const Size DESIGN_SIZE = const Size(375, 812);

  //////加密------------------------------
  ///秘钥(用于MD5加密)
  static const String ENCRYPTION_MD5_KEY = "Vg*2m5nI2y9yajVd";

  ///秘钥->公钥(用于RSA加密)
  static const String ENCRYPTION_RSA_KEY =
      "MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAj0F3NLM2Tw1R7mvP7dIstPaj4hn7k0xOR/Hx6wZk5MwGfGvvt0Fhk7tbDxW6ON2mYAg6+mqDXO3j4y7Yq+XJcSakjtYqUIuix5sZHvcO/MxwCqJYfmInkrIeTtMFyv6UZjQHuCUkjfpiy+4HRMp7n6ya2h7/1PKewDSoB7IMulyO23dOxrU/ZyDlBn7w4mW4RG/zz+l7HclmRu1iAOtcUKaBLmw1R0EXtMn/tDXO1cHHFnTtDFdkmoXX6PdPJ7QMg3gzwKktE7olqwo+atUSKjAEibVg2HC6/RnzDRaOzEWh1gamtFoJ4/e4i63H1CLDHFkwIytOpUV8pCPd8ZAaIQIDAQAB";
  static const String ENCRYPTION_RSA_BEGIN_KEY = "-----BEGIN PUBLIC KEY-----\n";
  static const String ENCRYPTION_RSA_END_KEY = "\n-----END PUBLIC KEY-----";

  //////验证码类型------------------------------
  ///注册
  static const String PHONE_CODE_TYPE_REGISTER = "1";

  ///登录
  static const String PHONE_CODE_TYPE_LOGIN = "2";

  ///忘记密码
  static const String PHONE_CODE_TYPE_FORGET_PAY = "4";
  static const String PHONE_CODE_TYPE_FORGET_PASSWORD = "3";

  //////提示语------------------------------
  static const String PHONE_NUMBER_ERROR = "请输入正确的手机号";
  static const String PASSWORD_EMPTY_ERROR = "密码不能为空";
  static const String PASSWORD_LENGTH_ERROR = "密码长度在8-12位";
  static const String VERIFICATION_CODE_LENGTH_ERROR = "验证码长度为6";
  static const String VERIFICATION_CODE_ERROR = "验证码不能为空";
  static const String VERIFICATION_CODE_SEND_SUCCESSFUL = "验证码发送成功";
  static const String LOGIN_READING_ERROR = "请阅读并勾选《用户协议》及《隐私协议》";

  //////关键字------------------------------
  static const String SHARED_PREFERENCES_LOGIN_KEY = "UserModel";

  ///临时用户关键字
  static const String BOX_TEMPORARILY_USER_LOGIN_KEY = "TemporarilyUserInfo";

  static const String LOGIN_TYPE = "LoginType";

  static const String FIRST_OPEN = "FirstOpen";

  ///宣传页样式
  static const String LEAFLETS = "leaflets";

  /// 首次进入
  static const String FIRST_IN = "FirstIn";

  /// 进入次数
  static const String IN_COUNT = "InCount";

  /// 进入时间
  static const String IN_TIMING = "InTiming";

  /// 触发弹窗时间
  static const String TRIGGER_POPUP_TIMING = "triggerPopupTiming";

  /// 是否触发弹窗
  static const String IS_POP = "IStriggerPopup";

  /// 首次进入报告
  static const String FIRST_OPEN_REPORT_DETAILS = "FirstOpenReportDetails";

  /// 首次进入报告样例
  static const String FIRST_OPEN_REPORT_SAMPLE = "FIRST_OPEN_REPORT_SAMPLE";

  /// 记录购买前置 订单id
  static const String Quick_BUY_Order_ID = "Quick_Buy_Order_ID";

  /// 记录购买输入的手机号 用于判断页面跳转
  static const String BUY_PHONE = "BUY_PHONE";

  /// 记录 订单时间
  static const String ORDER_TIME = "ORDER_TIME";

  /// 记录购买前 身份
  static const String Quick_STANDING = "Quick_Buy_Standing";

  /// 记录已经弹过评分的报告id
  static const String POP_REPORT_ID = "PopReportID";

  /// 是否在报告页弹过弹窗
  static const String IS_REPORT_DETAILS_POP = "IsReportDetailsPop";

  /// 报告页弹窗时间
  static const String REPORT_DETAILS_TIMING = "IsReportDetailsPop";

  static const String LOGIN_USER_TYPE = "requestUserType";

  static const String SHARED_PREFERENCES_ORDER_ID = "orderID";

  ///事件提醒列表
  static const String SHARED_EVENT_REMINDER = "Event_Reminder";

  ///是否有微信支付信息
  static const String IS_WECHAT_PAY_INFO = "isWechatPayInfo";

  ///收藏
  static const String SHARED_PREFERENCES_COLLECTION = "Collection";

  ///收藏公司列表
  static const String SHARED_PREFERENCES_COLLECTION_COMPANY =
      "Collection_Company";

  ///收藏公司列表
  static const String BOX_RANDOM_NUMBER = "Random_Number";

  ///存储环信用户名
  static const String BOX_HUANXIN_USER = "HUAN_XIN_USER";

  ///存储环信密码
  static const String BOX_HUANXIN_PASSWORD = "HUAN_XIN_PASSWORD";

  ///通知 监听订单倒计时
  static const String NOTIFICATION_COUNTDOWN = "NotificationCener_Countdown";

  //////网页html------------------------------
  /// 法律条文
  static const String LAW = """
<div data-v-b01365a4='' data-v-53b7d049='' class='content'>
    <div data-v-b01365a4='' class='wrap'>
        <h3  style="text-align:center">中华人民共和国个人隐私保护法</h3>
        <h4 style="text-align:center; color:#1932b9;"  >中华人民共和国主席令</h4>
        <div style="display: flex;
    justify-content: space-between;">
        <span>来源：中国人大网</span>
        <hr style=" height:1px;border:none;border-top:1px dotted #666;" /><br>
        </div>

        <div data-v-b01365a4='' class='explain'>
            <div data-v-b01365a4='' class='subTitle' style="text-align:center; color:#1932b9;">中华人民共和国主席令</div>
            <h6 style="text-align:center;">第九十一号</h6>
            <p data-v-b01365a4=''>《中华人民共和国个人信息保护法》已由中华人民共和国第第十三届全国人民代表大会常务委员会第三十次会议于2021年8月20日通过，现予公布，自2021年11月11日起施行。
            </p>
            <div data-v-b01365a4='' class='other'>
                <div data-v-b01365a4='' style="text-align:right;" ><span data-v-b01365a4=''>中华人民共和国主席 习近平</span></div>
                <div data-v-b01365a4='' style="text-align:right;"><time data-v-b01365a4=''>2021年8月20日</time></div>
                <div data-v-b01365a4='' style="text-align:right;"><span data-v-b01365a4=''>编辑：刘 冬</span></div>
                <div data-v-b01365a4='' style="text-align:right;"><span data-v-b01365a4=''>责编：于 浩</span></div>
            </div>
        </div>
        <div data-v-b01365a4='' class='text'>
            <h5 data-v-b01365a4=''>目录</h5>
            <ul>
            <li><a data-v-b01365a4='' href='#c1'>第一章 总 则</a></li>
           <li> <a data-v-b01365a4=''
                href='#c2'>第二章 个人信息处理规则</a>
               <li> <a data-v-b01365a4='' href='#c3'>第一节 一般规定</a></li>
               <li> <a data-v-b01365a4=''
                href='#c4'>第二节 敏感个人信息的处理规则</a></li>
               <li> <a data-v-b01365a4='' href='#c5'>第三节 国家机关处理个人信息的特别规定</a></li>
               <li> <a
                data-v-b01365a4='' href='#c6'>第三章 个人信息跨境提供的规则</a></li>
               <li> <a data-v-b01365a4='' href='#c7'>第四章
                个人在个人信息处理活动中的权利</a></li>
               <li> <a data-v-b01365a4='' href='#c8'>第五章 个人信息处理者的义务</a></li>
               <li> <a data-v-b01365a4=''
                href='#c9'>第六章 履行个人信息保护职责的部门</a></li>
               <li> <a data-v-b01365a4='' href='#c10'>第七章 法律责任</a></li>
               <li> <a data-v-b01365a4=''
                href='#c11'>第八章 附 则</a></li>
                </ul>
            <div data-v-b01365a4='' id='c1'>
                <p data-v-b01365a4=''>第一章 总 则</p>
                <p data-v-b01365a4=''>第一条 为了保护个人信息权益，规范个人信息处理活动，促进个人信息合理利用，根据宪法，制定本法。</p>
                <p data-v-b01365a4=''>第二条 自然人的个人信息受法律保护，任何组织、个人不得侵害自然人的个人信息权益。</p>
                <p data-v-b01365a4=''>第三条 在中华人民共和国境内处理自然人个人信息的活动，适用本法。</p>
                <p data-v-b01365a4=''>在中华人民共和国境外处理中华人民共和国境内自然人个人信息的活动，有下列情形之一的，也适用本法：</p>
                <p data-v-b01365a4=''>（一）以向境内自然人提供产品或者服务为目的；</p>
                <p data-v-b01365a4=''>（二）分析、评估境内自然人的行为；</p>
                <p data-v-b01365a4=''>（三）法律、行政法规规定的其他情形。</p>
                <p data-v-b01365a4=''>第四条
                    个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。个人信息的处理包括个人信息的收集、存储、使用、加工、传输、提供、公开、删除等。</p>
                <p data-v-b01365a4=''>第五条 处理个人信息应当遵循合法、正当、必要和诚信原则，不得通过误导、欺诈、胁迫等方式处理个人信息。</p>
                <p data-v-b01365a4=''>第六条
                    处理个人信息应当具有明确、合理的目的，并应当与处理目的直接相关，采取对个人权益影响最小的方式。收集个人信息，应当限于实现处理目的的最小范围，不得过度收集个人信息。</p>
                <p data-v-b01365a4=''>第七条 处理个人信息应当遵循公开、透明原则，公开个人信息处理规则，明示处理的目的、方式和范围。</p>
                <p data-v-b01365a4=''>第八条 处理个人信息应当保证个人信息的质量，避免因个人信息不准确、不完整对个人权益造成不利影响。</p>
                <p data-v-b01365a4=''>第九条 个人信息处理者应当对其个人信息处理活动负责，并采取必要措施保障所处理的个人信息的安全。</p>
                <p data-v-b01365a4=''>第十条 任何组织、个人不得非法收集、使用、加工、传输他人个人信息，不得非法买卖、提供或者公开他人个人信息；不得从事危害国家安全、公共利益的个人信息处理活动。</p>
                <p data-v-b01365a4=''>第十一条
                    国家建立健全个人信息保护制度，预防和惩治侵害个人信息权益的行为，加强个人信息保护宣传教育，推动形成政府、企业、相关社会组织、公众共同参与个人信息保护的良好环境。</p>
                <p data-v-b01365a4=''>第十二条 国家积极参与个人信息保护国际规则的制定，促进个人信息保护方面的国际交流与合作，推动与其他国家、地区、国际组织之间的个人信息保护规则、标准等互认。</p>
            </div>
            <div data-v-b01365a4='' id='c2'>
                <p data-v-b01365a4=''>第二章 个人信息处理规则</p>
                <p data-v-b01365a4='' id='c3'>第一节 一般规定</p>
                <p data-v-b01365a4=''>第十三条 符合下列情形之一的，个人信息处理者方可处理个人信息：</p>
                <p data-v-b01365a4=''>（一）取得个人的同意；</p>
                <p data-v-b01365a4=''>（二）为订立、履行个人作为一方当事人的合同所必需，或者按照依法制定的劳动规章制度和依法签订的集体合同实施人力资源管理所必需；</p>
                <p data-v-b01365a4=''>（三）为履行法定职责或者法定义务所必需；</p>
                <p data-v-b01365a4=''>（四）为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；</p>
                <p data-v-b01365a4=''>（五）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；</p>
                <p data-v-b01365a4=''>（六）依照本法规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；</p>
                <p data-v-b01365a4=''>（七）法律、行政法规规定的其他情形。</p>
                <p data-v-b01365a4=''>依照本法其他有关规定，处理个人信息应当取得个人同意，但是有前款第二项至第七项规定情形的，不需取得个人同意。</p>
                <p data-v-b01365a4=''>第十四条 基于个人同意处理个人信息的，该同意应当由个人在充分知情的前提下自愿、明确作出。法律、行政法规规定处理个人信息应当取得个人单独同意或者书面同意的，从其规定。
                </p>
                <p data-v-b01365a4=''>个人信息的处理目的、处理方式和处理的个人信息种类发生变更的，应当重新取得个人同意。</p>
                <p data-v-b01365a4=''>第十五条 基于个人同意处理个人信息的，个人有权撤回其同意。个人信息处理者应当提供便捷的撤回同意的方式。</p>
                <p data-v-b01365a4=''>个人撤回同意，不影响撤回前基于个人同意已进行的个人信息处理活动的效力。</p>
                <p data-v-b01365a4=''>第十六条 个人信息处理者不得以个人不同意处理其个人信息或者撤回同意为由，拒绝提供产品或者服务；处理个人信息属于提供产品或者服务所必需的除外。</p>
                <p data-v-b01365a4=''>第十七条 个人信息处理者在处理个人信息前，应当以显著方式、清晰易懂的语言真实、准确、完整地向个人告知下列事项：</p>
                <p data-v-b01365a4=''>（一）个人信息处理者的名称或者姓名和联系方式；</p>
                <p data-v-b01365a4=''>（二）个人信息的处理目的、处理方式，处理的个人信息种类、保存期限；</p>
                <p data-v-b01365a4=''>（三）个人行使本法规定权利的方式和程序；</p>
                <p data-v-b01365a4=''>（四）法律、行政法规规定应当告知的其他事项。</p>
                <p data-v-b01365a4=''>前款规定事项发生变更的，应当将变更部分告知个人。</p>
                <p data-v-b01365a4=''>个人信息处理者通过制定个人信息处理规则的方式告知第一款规定事项的，处理规则应当公开，并且便于查阅和保存。</p>
                <p data-v-b01365a4=''>第十八条 个人信息处理者处理个人信息，有法律、行政法规规定应当保密或者不需要告知的情形的，可以不向个人告知前条第一款规定的事项。</p>
                <p data-v-b01365a4=''>紧急情况下为保护自然人的生命健康和财产安全无法及时向个人告知的，个人信息处理者应当在紧急情况消除后及时告知。</p>
                <p data-v-b01365a4=''>第十九条 除法律、行政法规另有规定外，个人信息的保存期限应当为实现处理目的所必要的最短时间。</p>
                <p data-v-b01365a4=''>第二十条
                    两个以上的个人信息处理者共同决定个人信息的处理目的和处理方式的，应当约定各自的权利和义务。但是，该约定不影响个人向其中任何一个个人信息处理者要求行使本法规定的权利。</p>
                <p data-v-b01365a4=''>个人信息处理者共同处理个人信息，侵害个人信息权益造成损害的，应当依法承担连带责任。</p>
                <p data-v-b01365a4=''>第二十一条
                    个人信息处理者委托处理个人信息的，应当与受托人约定委托处理的目的、期限、处理方式、个人信息的种类、保护措施以及双方的权利和义务等，并对受托人的个人信息处理活动进行监督。</p>
                <p data-v-b01365a4=''>
                    受托人应当按照约定处理个人信息，不得超出约定的处理目的、处理方式等处理个人信息；委托合同不生效、无效、被撤销或者终止的，受托人应当将个人信息返还个人信息处理者或者予以删除，不得保留。</p>
                <p data-v-b01365a4=''>未经个人信息处理者同意，受托人不得转委托他人处理个人信息。</p>
                <p data-v-b01365a4=''>第二十二条
                    个人信息处理者因合并、分立、解散、被宣告破产等原因需要转移个人信息的，应当向个人告知接收方的名称或者姓名和联系方式。接收方应当继续履行个人信息处理者的义务。接收方变更原先的处理目的、处理方式的，应当依照本法规定重新取得个人同意。
                </p>
                <p data-v-b01365a4=''>第二十三条
                    个人信息处理者向其他个人信息处理者提供其处理的个人信息的，应当向个人告知接收方的名称或者姓名、联系方式、处理目的、处理方式和个人信息的种类，并取得个人的单独同意。接收方应当在上述处理目的、处理方式和个人信息的种类等范围内处理个人信息。接收方变更原先的处理目的、处理方式的，应当依照本法规定重新取得个人同意。
                </p>
                <p data-v-b01365a4=''>第二十四条 个人信息处理者利用个人信息进行自动化决策，应当保证决策的透明度和结果公平、公正，不得对个人在交易价格等交易条件上实行不合理的差别待遇。</p>
                <p data-v-b01365a4=''>通过自动化决策方式向个人进行信息推送、商业营销，应当同时提供不针对其个人特征的选项，或者向个人提供便捷的拒绝方式。</p>
                <p data-v-b01365a4=''>通过自动化决策方式作出对个人权益有重大影响的决定，个人有权要求个人信息处理者予以说明，并有权拒绝个人信息处理者仅通过自动化决策的方式作出决定。</p>
                <p data-v-b01365a4=''>第二十五条 个人信息处理者不得公开其处理的个人信息，取得个人单独同意的除外。</p>
                <p data-v-b01365a4=''>第二十六条
                    在公共场所安装图像采集、个人身份识别设备，应当为维护公共安全所必需，遵守国家有关规定，并设置显著的提示标识。所收集的个人图像、身份识别信息只能用于维护公共安全的目的，不得用于其他目的；取得个人单独同意的除外。
                </p>
                <p data-v-b01365a4=''>第二十七条
                    个人信息处理者可以在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；个人明确拒绝的除外。个人信息处理者处理已公开的个人信息，对个人权益有重大影响的，应当依照本法规定取得个人同意。</p>
                <p data-v-b01365a4='' id='c4'>第二节敏感个人信息的处理规则</p>
                <p data-v-b01365a4=''>第二十八条
                    敏感个人信息是一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。
                </p>
                <p data-v-b01365a4=''>只有在具有特定的目的和充分的必要性，并采取严格保护措施的情形下，个人信息处理者方可处理敏感个人信息。</p>
                <p data-v-b01365a4=''>第二十九条 处理敏感个人信息应当取得个人的单独同意；法律、行政法规规定处理敏感个人信息应当取得书面同意的，从其规定。</p>
                <p data-v-b01365a4=''>第三十条
                    个人信息处理者处理敏感个人信息的，除本法第十七条第一款规定的事项外，还应当向个人告知处理敏感个人信息的必要性以及对个人权益的影响；依照本法规定可以不向个人告知的除外。</p>
                <p data-v-b01365a4=''>第三十一条 个人信息处理者处理不满十四周岁未成年人个人信息的，应当取得未成年人的父母或者其他监护人的同意。</p>
                <p data-v-b01365a4=''>个人信息处理者处理不满十四周岁未成年人个人信息的，应当制定专门的个人信息处理规则。</p>
                <p data-v-b01365a4=''>第三十二条 法律、行政法规对处理敏感个人信息规定应当取得相关行政许可或者作出其他限制的，从其规定。</p>
                <p data-v-b01365a4='' id='c5'>第三节 国家机关处理个人信息的特别规定</p>
                <p data-v-b01365a4=''>第三十三条 国家机关处理个人信息的活动，适用本法；本节有特别规定的，适用本节规定。</p>
                <p data-v-b01365a4=''>第三十四条 国家机关为履行法定职责处理个人信息，应当依照法律、行政法规规定的权限、程序进行，不得超出履行法定职责所必需的范围和限度。</p>
                <p data-v-b01365a4=''>第三十五条 国家机关为履行法定职责处理个人信息，应当依照本法规定履行告知义务；有本法第十八条第一款规定的情形，或者告知将妨碍国家机关履行法定职责的除外。</p>
                <p data-v-b01365a4=''>第三十六条 国家机关处理的个人信息应当在中华人民共和国境内存储；确需向境外提供的，应当进行安全评估。安全评估可以要求有关部门提供支持与协助。</p>
                <p data-v-b01365a4=''>第三十七条 法律、法规授权的具有管理公共事务职能的组织为履行法定职责处理个人信息，适用本法关于国家机关处理个人信息的规定。</p>
                <p data-v-b01365a4='' id='c6'>第三章 个人信息跨境提供的规则</p>
                <p data-v-b01365a4=''>第三十八条 个人信息处理者因业务等需要，确需向中华人民共和国境外提供个人信息的，应当具备下列条件之一：</p>
                <p data-v-b01365a4=''>（一）依照本法第四十条的规定通过国家网信部门组织的安全评估；</p>
                <p data-v-b01365a4=''>（二）按照国家网信部门的规定经专业机构进行个人信息保护认证；</p>
                <p data-v-b01365a4=''>（三）按照国家网信部门制定的标准合同与境外接收方订立合同，约定双方的权利和义务；</p>
                <p data-v-b01365a4=''>（四）法律、行政法规或者国家网信部门规定的其他条件。</p>
                <p data-v-b01365a4=''>中华人民共和国缔结或者参加的国际条约、协定对向中华人民共和国境外提供个人信息的条件等有规定的，可以按照其规定执行。</p>
                <p data-v-b01365a4=''>个人信息处理者应当采取必要措施，保障境外接收方处理个人信息的活动达到本法规定的个人信息保护标准。</p>
                <p data-v-b01365a4=''>第三十九条
                    个人信息处理者向中华人民共和国境外提供个人信息的，应当向个人告知境外接收方的名称或者姓名、联系方式、处理目的、处理方式、个人信息的种类以及个人向境外接收方行使本法规定权利的方式和程序等事项，并取得个人的单独同意。
                </p>
                <p data-v-b01365a4=''>第四十条
                    关键信息基础设施运营者和处理个人信息达到国家网信部门规定数量的个人信息处理者，应当将在中华人民共和国境内收集和产生的个人信息存储在境内。确需向境外提供的，应当通过国家网信部门组织的安全评估；法律、行政法规和国家网信部门规定可以不进行安全评估的，从其规定。
                </p>
                <p data-v-b01365a4=''>第四十一条
                    中华人民共和国主管机关根据有关法律和中华人民共和国缔结或者参加的国际条约、协定，或者按照平等互惠原则，处理外国司法或者执法机构关于提供存储于境内个人信息的请求。非经中华人民共和国主管机关批准，个人信息处理者不得向外国司法或者执法机构提供存储于中华人民共和国境内的个人信息。
                </p>
                <p data-v-b01365a4=''>第四十二条
                    境外的组织、个人从事侵害中华人民共和国公民的个人信息权益，或者危害中华人民共和国国家安全、公共利益的个人信息处理活动的，国家网信部门可以将其列入限制或者禁止个人信息提供清单，予以公告，并采取限制或者禁止向其提供个人信息等措施。
                </p>
                <p data-v-b01365a4=''>第四十三条 任何国家或者地区在个人信息保护方面对中华人民共和国采取歧视性的禁止、限制或者其他类似措施的，中华人民共和国可以根据实际情况对该国家或者地区对等采取措施。
                </p>
                <p data-v-b01365a4='' id='c7'>第四章 个人在个人信息处理活动中的权利</p>
                <p data-v-b01365a4=''>第四十四条 个人对其个人信息的处理享有知情权、决定权，有权限制或者拒绝他人对其个人信息进行处理；法律、行政法规另有规定的除外。</p>
                <p data-v-b01365a4=''>第四十五条 个人有权向个人信息处理者查阅、复制其个人信息；有本法第十八条第一款、第三十五条规定情形的除外。</p>
                <p data-v-b01365a4=''>个人请求查阅、复制其个人信息的，个人信息处理者应当及时提供。</p>
                <p data-v-b01365a4=''>个人请求将个人信息转移至其指定的个人信息处理者，符合国家网信部门规定条件的，个人信息处理者应当提供转移的途径。</p>
                <p data-v-b01365a4=''>第四十六条 个人发现其个人信息不准确或者不完整的，有权请求个人信息处理者更正、补充。</p>
                <p data-v-b01365a4=''>个人请求更正、补充其个人信息的，个人信息处理者应当对其个人信息予以核实，并及时更正、补充。</p>
                <p data-v-b01365a4=''>第四十七条 有下列情形之一的，个人信息处理者应当主动删除个人信息；个人信息处理者未删除的，个人有权请求删除：</p>
                <p data-v-b01365a4=''>（一）处理目的已实现、无法实现或者为实现处理目的不再必要；</p>
                <p data-v-b01365a4=''>（二）个人信息处理者停止提供产品或者服务，或者保存期限已届满；</p>
                <p data-v-b01365a4=''>（三）个人撤回同意；</p>
                <p data-v-b01365a4=''>（四）个人信息处理者违反法律、行政法规或者违反约定处理个人信息；</p>
                <p data-v-b01365a4=''>（五）法律、行政法规规定的其他情形。</p>
                <p data-v-b01365a4=''>法律、行政法规规定的保存期限未届满，或者删除个人信息从技术上难以实现的，个人信息处理者应当停止除存储和采取必要的安全保护措施之外的处理。</p>
                <p data-v-b01365a4=''>第四十八条 个人有权要求个人信息处理者对其个人信息处理规则进行解释说明。</p>
                <p data-v-b01365a4=''>第四十九条 自然人死亡的，其近亲属为了自身的合法、正当利益，可以对死者的相关个人信息行使本章规定的查阅、复制、更正、删除等权利；死者生前另有安排的除外。</p>
                <p data-v-b01365a4=''>第五十条 个人信息处理者应当建立便捷的个人行使权利的申请受理和处理机制。拒绝个人行使权利的请求的，应当说明理由。</p>
                <p data-v-b01365a4=''>个人信息处理者拒绝个人行使权利的请求的，个人可以依法向人民法院提起诉讼。</p>
                <p data-v-b01365a4='' id='c8'>第五章 个人信息处理者的义务</p>
                <p data-v-b01365a4=''>第五十一条
                    个人信息处理者应当根据个人信息的处理目的、处理方式、个人信息的种类以及对个人权益的影响、可能存在的安全风险等，采取下列措施确保个人信息处理活动符合法律、行政法规的规定，并防止未经授权的访问以及个人信息泄露、篡改、丢失：
                </p>
                <p data-v-b01365a4=''>（一）制定内部管理制度和操作规程；</p>
                <p data-v-b01365a4=''>（二）对个人信息实行分类管理；</p>
                <p data-v-b01365a4=''>（三）采取相应的加密、去标识化等安全技术措施；</p>
                <p data-v-b01365a4=''>（四）合理确定个人信息处理的操作权限，并定期对从业人员进行安全教育和培训；</p>
                <p data-v-b01365a4=''>（五）制定并组织实施个人信息安全事件应急预案；</p>
                <p data-v-b01365a4=''>（六）法律、行政法规规定的其他措施。</p>
                <p data-v-b01365a4=''>第五十二条 处理个人信息达到国家网信部门规定数量的个人信息处理者应当指定个人信息保护负责人，负责对个人信息处理活动以及采取的保护措施等进行监督。</p>
                <p data-v-b01365a4=''>个人信息处理者应当公开个人信息保护负责人的联系方式，并将个人信息保护负责人的姓名、联系方式等报送履行个人信息保护职责的部门。</p>
                <p data-v-b01365a4=''>第五十三条
                    本法第三条第二款规定的中华人民共和国境外的个人信息处理者，应当在中华人民共和国境内设立专门机构或者指定代表，负责处理个人信息保护相关事务，并将有关机构的名称或者代表的姓名、联系方式等报送履行个人信息保护职责的部门。
                </p>
                <p data-v-b01365a4=''>第五十四条 个人信息处理者应当定期对其处理个人信息遵守法律、行政法规的情况进行合规审计。</p>
                <p data-v-b01365a4=''>第五十五条 有下列情形之一的，个人信息处理者应当事前进行个人信息保护影响评估，并对处理情况进行记录：</p>
                <p data-v-b01365a4=''>（一）处理敏感个人信息；</p>
                <p data-v-b01365a4=''>（二）利用个人信息进行自动化决策；</p>
                <p data-v-b01365a4=''>（三）委托处理个人信息、向其他个人信息处理者提供个人信息、公开个人信息；</p>
                <p data-v-b01365a4=''>（四）向境外提供个人信息；</p>
                <p data-v-b01365a4=''>（五）其他对个人权益有重大影响的个人信息处理活动。</p>
                <p data-v-b01365a4=''>第五十六条 个人信息保护影响评估应当包括下列内容：</p>
                <p data-v-b01365a4=''>（一）个人信息的处理目的、处理方式等是否合法、正当、必要；</p>
                <p data-v-b01365a4=''>（二）对个人权益的影响及安全风险；</p>
                <p data-v-b01365a4=''>（三）所采取的保护措施是否合法、有效并与风险程度相适应。</p>
                <p data-v-b01365a4=''>个人信息保护影响评估报告和处理情况记录应当至少保存三年。</p>
                <p data-v-b01365a4=''>第五十七条 发生或者可能发生个人信息泄露、篡改、丢失的，个人信息处理者应当立即采取补救措施，并通知履行个人信息保护职责的部门和个人。通知应当包括下列事项：</p>
                <p data-v-b01365a4=''>（一）发生或者可能发生个人信息泄露、篡改、丢失的信息种类、原因和可能造成的危害； </p>
                <p data-v-b01365a4=''>（二）个人信息处理者采取的补救措施和个人可以采取的减轻危害的措施；</p>
                <p data-v-b01365a4=''>（三）个人信息处理者的联系方式。</p>
                <p data-v-b01365a4=''>
                    个人信息处理者采取措施能够有效避免信息泄露、篡改、丢失造成危害的，个人信息处理者可以不通知个人；履行个人信息保护职责的部门认为可能造成危害的，有权要求个人信息处理者通知个人。</p>
                <p data-v-b01365a4=''>第五十八条 提供重要互联网平台服务、用户数量巨大、业务类型复杂的个人信息处理者，应当履行下列义务：</p>
                <p data-v-b01365a4=''>（一）按照国家规定建立健全个人信息保护合规制度体系，成立主要由外部成员组成的独立机构对个人信息保护情况进行监督；</p>
                <p data-v-b01365a4=''>（二）遵循公开、公平、公正的原则，制定平台规则，明确平台内产品或者服务提供者处理个人信息的规范和保护个人信息的义务；</p>
                <p data-v-b01365a4=''>（三）对严重违反法律、行政法规处理个人信息的平台内的产品或者服务提供者，停止提供服务；</p>
                <p data-v-b01365a4=''>（四）定期发布个人信息保护社会责任报告，接受社会监督。</p>
                <p data-v-b01365a4=''>第五十九条 接受委托处理个人信息的受托人，应当依照本法和有关法律、行政法规的规定，采取必要措施保障所处理的个人信息的安全，并协助个人信息处理者履行本法规定的义务。
                </p>
                <p data-v-b01365a4='' id='c9'>第六章 履行个人信息保护职责的部门</p>
                <p data-v-b01365a4=''>第六十条
                    国家网信部门负责统筹协调个人信息保护工作和相关监督管理工作。国务院有关部门依照本法和有关法律、行政法规的规定，在各自职责范围内负责个人信息保护和监督管理工作。</p>
                <p data-v-b01365a4=''>县级以上地方人民政府有关部门的个人信息保护和监督管理职责，按照国家有关规定确定。</p>
                <p data-v-b01365a4=''>前两款规定的部门统称为履行个人信息保护职责的部门。</p>
                <p data-v-b01365a4=''>第六十一条 履行个人信息保护职责的部门履行下列个人信息保护职责：</p>
                <p data-v-b01365a4=''>（一）开展个人信息保护宣传教育，指导、监督个人信息处理者开展个人信息保护工作；</p>
                <p data-v-b01365a4=''>（二）接受、处理与个人信息保护有关的投诉、举报；</p>
                <p data-v-b01365a4=''>（三）组织对应用程序等个人信息保护情况进行测评，并公布测评结果；</p>
                <p data-v-b01365a4=''>（四）调查、处理违法个人信息处理活动；</p>
                <p data-v-b01365a4=''>（五）法律、行政法规规定的其他职责。</p>
                <p data-v-b01365a4=''>第六十二条 国家网信部门统筹协调有关部门依据本法推进下列个人信息保护工作：</p>
                <p data-v-b01365a4=''>（一）制定个人信息保护具体规则、标准；</p>
                <p data-v-b01365a4=''>（二）针对小型个人信息处理者、处理敏感个人信息以及人脸识别、人工智能等新技术、新应用，制定专门的个人信息保护规则、标准；</p>
                <p data-v-b01365a4=''>（三）支持研究开发和推广应用安全、方便的电子身份认证技术，推进网络身份认证公共服务建设；</p>
                <p data-v-b01365a4=''>（四）推进个人信息保护社会化服务体系建设，支持有关机构开展个人信息保护评估、认证服务；</p>
                <p data-v-b01365a4=''>（五）完善个人信息保护投诉、举报工作机制。</p>
                <p data-v-b01365a4=''>第六十三条 履行个人信息保护职责的部门履行个人信息保护职责，可以采取下列措施：</p>
                <p data-v-b01365a4=''>（一）询问有关当事人，调查与个人信息处理活动有关的情况;</p>
                <p data-v-b01365a4=''>（二）查阅、复制当事人与个人信息处理活动有关的合同、记录、账簿以及其他有关资料;</p>
                <p data-v-b01365a4=''>（三）实施现场检查，对涉嫌违法的个人信息处理活动进行调查;</p>
                <p data-v-b01365a4=''>（四）检查与个人信息处理活动有关的设备、物品;对有证据证明是用于违法个人信息处理活动的设备、物品，向本部门主要负责人书面报告并经批准，可以查封或者扣押。</p>
                <p data-v-b01365a4=''>履行个人信息保护职责的部门依法履行职责，当事人应当予以协助、配合，不得拒绝、阻挠。</p>
                <p data-v-b01365a4=''>第六十四条
                    履行个人信息保护职责的部门在履行职责中，发现个人信息处理活动存在较大风险或者发生个人信息安全事件的，可以按照规定的权限和程序对该个人信息处理者的法定代表人或者主要负责人进行约谈，或者要求个人信息处理者委托专业机构对其个人信息处理活动进行合规审计。个人信息处理者应当按照要求采取措施，进行整改，消除隐患。
                </p>
                <p data-v-b01365a4=''>履行个人信息保护职责的部门在履行职责中，发现违法处理个人信息涉嫌犯罪的，应当及时移送公安机关依法处理。</p>
                <p data-v-b01365a4=''>第六十五条 任何组织、个人有权对违法个人信息处理活动向履行个人信息保护职责的部门进行投诉、举报。收到投诉、举报的部门应当依法及时处理，并将处理结果告知投诉、举报人。
                </p>
                <p data-v-b01365a4=''>履行个人信息保护职责的部门应当公布接受投诉、举报的联系方式。</p>
                <p data-v-b01365a4='' id='c10'>第七章 法律责任</p>
                <p data-v-b01365a4=''>第六十六条
                    违反本法规定处理个人信息，或者处理个人信息未履行本法规定的个人信息保护义务的，由履行个人信息保护职责的部门责令改正，给予警告，没收违法所得，对违法处理个人信息的应用程序，责令暂停或者终止提供服务；拒不改正的，并处一百万元以下罚款；对直接负责的主管人员和其他直接责任人员处一万元以上十万元以下罚款。
                </p>
                <p data-v-b01365a4=''>
                    有前款规定的违法行为，情节严重的，由省级以上履行个人信息保护职责的部门责令改正，没收违法所得，并处五千万元以下或者上一年度营业额百分之五以下罚款，并可以责令暂停相关业务或者停业整顿、通报有关主管部门吊销相关业务许可或者吊销营业执照；对直接负责的主管人员和其他直接责任人员处十万元以上一百万元以下罚款，并可以决定禁止其在一定期限内担任相关企业的董事、监事、高级管理人员和个人信息保护负责人。
                </p>
                <p data-v-b01365a4=''>第六十七条 有本法规定的违法行为的，依照有关法律、行政法规的规定记入信用档案，并予以公示。</p>
                <p data-v-b01365a4=''>第六十八条 国家机关不履行本法规定的个人信息保护义务的，由其上级机关或者履行个人信息保护职责的部门责令改正；对直接负责的主管人员和其他直接责任人员依法给予处分。
                </p>
                <p data-v-b01365a4=''>履行个人信息保护职责的部门的工作人员玩忽职守、滥用职权、徇私舞弊，尚不构成犯罪的，依法给予处分。</p>
                <p data-v-b01365a4=''>第六十九条 处理个人信息侵害个人信息权益造成损害，个人信息处理者不能证明自己没有过错的，应当承担损害赔偿等侵权责任。</p>
                <p data-v-b01365a4=''>
                    前款规定的损害赔偿责任按照个人因此受到的损失或者个人信息处理者因此获得的利益确定;个人因此受到的损失和个人信息处理者因此获得的利益难以确定的，根据实际情况确定赔偿数额。</p>
                <p data-v-b01365a4=''>第七十条 个人信息处理者违反本法规定处理个人信息，侵害众多个人的权益的，人民检察院、法律规定的消费者组织和由国家网信部门确定的组织可以依法向人民法院提起诉讼。
                </p>
                <p data-v-b01365a4=''>第七十一条 违反本法规定，构成违反治安管理行为的，依法给予治安管理处罚；构成犯罪的，依法追究刑事责任。</p>
                <p data-v-b01365a4='' id='c11'>第八章 附 则</p>
                <p data-v-b01365a4=''>第七十二条 自然人因个人或者家庭事务处理个人信息的，不适用本法。</p>
                <p data-v-b01365a4=''>法律对各级人民政府及其有关部门组织实施的统计、档案管理活动中的个人信息处理有规定的，适用其规定。</p>
                <p data-v-b01365a4=''>第七十三条 本法下列用语的含义：</p>
                <p data-v-b01365a4=''>（一）个人信息处理者，是指在个人信息处理活动中自主决定处理目的、处理方式的组织、个人。</p>
                <p data-v-b01365a4=''>（二）自动化决策，是指通过计算机程序自动分析、评估个人的行为习惯、兴趣爱好或者经济、健康、信用状况等，并进行决策的活动。</p>
                <p data-v-b01365a4=''>（三）去标识化，是指个人信息经过处理，使其在不借助额外信息的情况下无法识别特定自然人的过程。</p>
                <p data-v-b01365a4=''>（四）匿名化，是指个人信息经过处理无法识别特定自然人且不能复原的过程。</p>
                <p data-v-b01365a4=''>第七十四条 本法自2021年11月1日起施行。</p>
                <p data-v-b01365a4=''>（来源：全国人大网）</p>
            </div>
        </div>
    </div>
</div>""";

  /// 用户协议
  static const String USER_AGREEMENT = """
<div id="app"><div data-v-d3141d60="" class="content"><h3 data-v-d3141d60="" class="title" style="text-align:center">“慧眼查APP”用户协议</h3><p data-v-d3141d60="">欢迎您使用“慧眼查APP”平台（以下简称“本平台”）！</p><p data-v-d3141d60="">为了更好地为您提供服务，请您仔细阅读《“慧眼查APP”用户协议》（以下简称“本协议”）。在您开始使用本平台服务（以下简称“本服务”）之前，请您务必认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通和使用特殊单项服务的条款、法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用本服务。</p><p data-v-d3141d60=""><strong data-v-d3141d60="">如您不同意本协议，这将导致我们无法为您提供服务。如你选择同意或使用本服务，则视为您已充分理解本协议并承诺作为本协议的一方当事人接受协议、隐私政策以及与本平台相关的规则、规范、声明、公告、通知等内容的约束。</strong></p><h4 data-v-d3141d60="">1、适用范围</h4><p data-v-d3141d60=""> 1.1 本协议是您与本平台之间就您注册、登录、使用本平台服务，或者获得本平台提供的任何服务所订立的协议。就本协议项下涉及的某些服务，可能会由本平台的关联公司向您提供，您知晓并同意接受上述服务内容，即视为接受双方之间的相关权利义务关系亦受本协议约束。</p><p data-v-d3141d60="">1.2 “您”是指提交有效申请并注册后，在本平台注册、登录、上传、发布等以各种形式传播内容（包括文字、图片等）的自然人、法人或其他组织。在本协议中称为“网民”或称“您”。 </p><p data-v-d3141d60="">1.3您注册本平台账号后可以通过本平台上传发布内容，向用户传播信息、与用户交流互动等。本平台是提供网络信息存储空间的网络服务提供者。</p><p data-v-d3141d60="">1.4 本协议内容同时包括本平台已经发布及后续可能不断发布的关于本平台服务的相关协议、规则等内容。前述内容一经正式发布，并以适当的方式送达用户（网站公布、系统通知等），即为本协议不可分割的组成部分，您应同样遵守。</p><h4 data-v-d3141d60=""> 2、关于“账号”</h4><p data-v-d3141d60="">2.1 本服务为您提供了注册通道，您有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。您设置的账号、密码是您用以登录并以注册用户身份使用本服务的凭证。</p><h4 data-v-d3141d60=""> 3、用户个人信息保护</h4><p data-v-d3141d60="">公司与您一同致力于您个人信息的保护，保护用户个人信息是本平台的基本原则之一。在使用本平台及相关服务的过程中，您可能需要提供您的个人信息（包括但不限于姓名、电话号码、位置信息等），以便公司向您提供更好的服务和相应的技术支持。公司将运用加密技术、匿名化处理等其他与本平台及相关服务相匹配的技术措施及其他安全措施保护您的个人信息，更多关于用户个人信息保护的内容，请参见《隐私政策》。</p><h4 data-v-d3141d60=""> 4、权利和义务</h4><p data-v-d3141d60="">4.1 行为要求</p><p data-v-d3141d60="">您应当对您使用本服务的行为负责，除非法律允许或者经本平台事先书面许可，您使用本服务不得具有下列行为： </p><p data-v-d3141d60="">4.1.1 使用未经本平台授权或许可的任何插件、外挂、系统或第三方工具对本服务的正常运行进行干扰、破坏、修改或施加其他影响。</p><p data-v-d3141d60="">4.1.2 利用或针对本服务进行任何危害计算机网络安全的行为，包括但不限于：</p><p data-v-d3141d60="">（1）非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动； </p><p data-v-d3141d60="">（2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；</p><p data-v-d3141d60="">（3）明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助；</p><p data-v-d3141d60="">（4）使用未经许可的数据或进入未经许可的服务器/账号；</p><p data-v-d3141d60="">（5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；</p><p data-v-d3141d60="">（6）未经许可，企图探查、扫描、测试本服务系统或网络的弱点或其它实施破坏网络安全的行为；</p><p data-v-d3141d60="">（7）企图干涉、破坏本服务系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；</p><p data-v-d3141d60="">（8）伪造TCP/IP数据包名称或部分名称。</p><p data-v-d3141d60="">4.1.3 对本服务进行反向工程、反向汇编、编译或者以其他方式尝试发现本服务的源代码。</p><p data-v-d3141d60="">4.1.4 恶意注册本服务账号，包括但不限于频繁、批量注册账号。 </p><p data-v-d3141d60="">4.1.5 违反法律法规、本协议、平台的相关规则及侵犯他人合法权益的其他行为。</p><p data-v-d3141d60="">在任何情况下，如果平台有理由认为您的任何行为违反或可能违反上述约定的，平台可独立进行判断并处理，且在任何时候有权在进行任何事先通知的情况下终止向本平台用户提供服务，并追究相关责任。</p><p data-v-d3141d60="">4.2 信息内容权利及规范</p><p data-v-d3141d60="">4.2.1您的制作、复制、上传、 <strong data-v-d3141d60="">发布、传播、评论等内容应自觉遵守宪法法律、法规、遵守公共秩序，尊重社会公德、社会主义制度、国家利益、公民合法权益、道德风尚和信息真实性等要求。您不得制作、复制、上传、发布、传播法律、行政法规禁止的下列信息内容：</strong></p><p data-v-d3141d60=""> （1）反对宪法确定的基本原则的；</p><p data-v-d3141d60="">（2）危害国家安全，泄露国家秘密的；</p><p data-v-d3141d60="">（3）颠覆国家政权，推翻社会主义制度、煽动分裂国家、破坏国家统一的；</p><p data-v-d3141d60="">（4）损害国家荣誉和利益的；</p><p data-v-d3141d60="">（5）宣扬恐怖主义、极端主义的；</p><p data-v-d3141d60="">（6）宣扬民族仇恨、民族歧视，破坏民族团结的；</p><p data-v-d3141d60="">（7）煽动地域歧视、地域仇恨的；</p><p data-v-d3141d60="">（8）破坏国家宗教政策，宣扬邪教和迷信的；</p><p data-v-d3141d60="">（9）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；</p><p data-v-d3141d60="">（10）散布、传播暴力、淫秽、色情、赌博、凶杀、恐怖或者教唆犯罪的；</p><p data-v-d3141d60="">（11）侵害未成年人合法权益或者损害未成年人身心健康的；</p><p data-v-d3141d60="">（12）未获他人允许，偷拍、偷录他人，侵害他人合法权利的；</p><p data-v-d3141d60="">（13）包含恐怖、暴力血腥、高危险性、危害表演者自身或他人身心健康内容的；</p><p data-v-d3141d60="">（14）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；</p><p data-v-d3141d60="">（15）侮辱或者诽谤他人，侵害他人合法权益的；</p><p data-v-d3141d60="">（16）对他人进行暴力恐吓、威胁，实施人肉搜索的；</p><p data-v-d3141d60="">（17）涉及他人隐私、个人信息或资料的；</p><p data-v-d3141d60="">（18）散布污言秽语，损害社会公序良俗的；</p><p data-v-d3141d60="">（19）侵犯他人隐私权、名誉权、肖像权、知识产权、商业秘密等合法权益内容的；</p><p data-v-d3141d60="">（20）未经平台许可，利用本服务为自己或第三方进行推广、发布广告的（包括但不限于加入第三方链接、广告等行为）；</p><p data-v-d3141d60="">（21）过度营销信息，骚扰信息和/或垃圾信息、低俗类信息、垃圾广告的；</p><p data-v-d3141d60="">（22）使用本平台常用语言文字以外的其他语言文字制作、复制、上传、发布、传播的内容、留言、评论的；</p><p data-v-d3141d60=""> （23）与所制作、复制、上传、发布、传播的内容、留言、评论的信息毫无关系的；</p><p data-v-d3141d60="">（24）所发布、传播的内容毫无意义的，或刻意使用字符组合以逃避技术审核的；</p><p data-v-d3141d60="">（25）其他违反法律法规、政策及公序良俗、干扰平台正常运营或侵犯其他用户或第三方合法权益内容的其他信息。</p><p data-v-d3141d60="">4.3 为确保平台和用户的利益，您请在使用本服务时，不要进行如下行为（该行为是指使用本平台的账号所进行的任何行为，包括但不限于注册登录、帐号运营、管理及推广以及其他行为）：</p><p data-v-d3141d60="">4.3.1 提交、发布虚假信息，或冒充、利用他人名义进行相关活动；</p><p data-v-d3141d60="">4.3.2 强制、诱导其他用户关注、点击链接页面或分享信息；</p><p data-v-d3141d60="">4.3.3 虚构事实、隐瞒真相以误导、欺骗他人；</p><p data-v-d3141d60="">4.3.4 利用平台及帐户从事违法犯罪活动；</p><p data-v-d3141d60="">4.3.5 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播；</p><p data-v-d3141d60="">4.3.6 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或未经公司明示授权的行为。</p><p data-v-d3141d60=""> 4.4平台设立公众投诉、举报平台，用户可按照平台公示的投诉举报制度向平台投诉、举报各类违法违规行为、违法传播活动、违法有害信息等内容，平台将及时受理和处理用户投诉举报，以共同营造风清气正的网络空间。</p><h4 data-v-d3141d60="">5、平台数据使用规范</h4><p data-v-d3141d60="">5.1 未经平台书面许可，您不得自行或授权、允许、协助任何第三人对本协议平台服务中信息内容进行如下行为：</p><p data-v-d3141d60="">（1）复制、读取、采用平台服务的信息内容，用于包括但不限于宣传、增加阅读量、浏览量等商业用途；</p><p data-v-d3141d60="">（2）采用包括但不限于特殊标识、特殊代码等任何形式的识别方法，自行或协助第三人对本服务的信息或内容产生流量、阅读量引导、转移、劫持等不利影响；</p><p data-v-d3141d60="">（3）其他非法获取本服务的信息内容的行为。</p><p data-v-d3141d60="">5.2 经平台书面许可后，您对平台服务的信息和内容的分享、转发等行为，还应符合以下规范：</p><p data-v-d3141d60=""> （1）对抓取、统计、获得的相关搜索热词、分类、排名、搜索量、点击率、阅读量等相关数据，未经平台事先书面同意，不得将上述数据以任何方式公示、提供、泄露给任何第三人；</p><p data-v-d3141d60="">（2）不得对本服务的源网页进行任何形式的任何改动，包括但不限于本服务的主页、各功能接口、广告系统链接等入口，也不得对奔入服务的源页面的展示进行任何形式的遮挡、插入、弹窗等妨碍；</p><p data-v-d3141d60="">（3）应当采取安全、有效、严密的措施，防止本服务的信息内容被第三方通过包括但不限于“蜘蛛”（spider）程序等任何形式进行非法获取；</p><p data-v-d3141d60="">（4）不得把相关数据内容用于平台书面许可范围之外的目的，进行任何形式的销售和商业使用，或向第三方泄露、提供或允许第三方为任何方式的使用。</p><p data-v-d3141d60="">（5）您向任何第三人分享、转发、复制本相关服务信息内容的行为，还应遵守公司为此制定的其他规范和标准。</p><h4 data-v-d3141d60=""> 6、违约处理</h4><p data-v-d3141d60=""><strong data-v-d3141d60="">6.1 针对您违反本协议、隐私政策以及与平台相关的规则、规范、声明、公告、通知等内容的行为，平台有权独立判断并视情况采取预先警示、拒绝发布、要求整改、立即停止传输信息、删除内容/留言/跟帖、暂停更新、冻结账户权益、限制账号部分或者全部功能直至永久关闭账号、要求承担违约或侵权责任等措施。平台有权公告处理结果，且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">6.2 因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行承担全部法律责任。因您的违法或违约行为导致平台及其关联公司损失、或向任何第三方赔偿或遭受国家机关处罚的，平台有权撤回、追缴金额，您应承担违约/侵权责任并应足额赔偿平台及其关联公司因此遭受的全部损失。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">6.3 平台尊重并保护法人、公民的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用本服务时上传的文字、图片、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，平台有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行承担全部法律责任；如因您的侵权行为导致平台及其关联公司遭受损失的（包括经济、商誉等损失），您还应足额赔偿平台及其关联公司遭受的全部损失。</strong></p><h4 data-v-d3141d60=""> 7、服务的变更、中断和终止</h4><p data-v-d3141d60="">7.1 您理解并同意，平台提供的服务是按照现有技术和条件所能达到的现状提供的。平台会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，公司不能随时预见和防范技术以及其他风险，包括但不限于不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用本服务以及其他的损失和风险。</p><p data-v-d3141d60="">7.2 您理解并同意，平台为了服务整体运营、平台运营安全的需要，有权视具体情况决定服务/功能设置、范围，修改、中断、中止或终止平台服务。</p><h4 data-v-d3141d60="">8、知识产权</h4><p data-v-d3141d60="">8.1 平台在本服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于平台所有。平台提供本服务时所依托的软件的著作权、专利权及其他知识产权均归平台所有。未经平台许可，任何人不得擅自使用（包括但不限于通过任何机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像本服务中的内容）。</p><p data-v-d3141d60=""><strong data-v-d3141d60="">8.2 您理解并同意，在使用本服务时发布上传的文字、图片、视频、音频等均由您原创或已获合法授权。您通过个人账号在平台上传、发布的任何内容的知识产权归属您或原始著作权人所有，且不得侵犯任何第三方的合法权利（包括但不限于知识产权）。</strong></p><p data-v-d3141d60="">8.3 平台为自身的开发、运营提供技术支持，并对服务的开发和运营等过程中产生的所有数据和信息等享有全部权利。</p><h4 data-v-d3141d60="">9、免责声明</h4><p data-v-d3141d60=""><strong data-v-d3141d60=""> 9.1 您理解并同意，本服务可能会受多种因素的影响或干扰，平台不保证(包括但不限于)：</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.1.1 平台服务完全适合用户的使用所有要求；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.1.2 平台不受干扰，及时、安全、可靠或不出现错误；用户经由平台取得的任何软件、服务或其他材料符合用户的期望；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.1.3 软件中任何错误都将能得到更正。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.2 如果有对于涉嫌借款或其他涉财产的网络信息、账户密码、广告或推广等信息的，请您谨慎对待并自行进行判断，基于前述原因您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失，平台不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.3 您理解并同意，在使用本服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害、网络原因、黑客攻击、战争或任何其它类似事件。出现不可抗力情况时，平台将努力在第一时间及时修复，但因不可抗力给用户造成的损失，平台不承担责任。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.4 平台依据本协议约定获得处理违法违规内容的权利，该权利不构成平台的义务或承诺，平台不能保证及时发现违法行为或进行相应处理。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.5 您阅读、理解并同意：关于本协议服务，平台不提供任何种类的明示或暗示担保或条件，包括但不限于商业适售性、特定用途适用性等。您对本服务的使用行为一定程度需自行承担相应风险。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">9.6 您阅读、理解并同意，本协议是在保障遵守国家法律法规、维护公序良俗，保护他人合法权益，平台在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证平台判断完全与司法机关、行政机关的判断一致，如因此产生的后果用户已经理解并同意自行承担。</strong></p><h4 data-v-d3141d60="">10、未成年人使用条款</h4><p data-v-d3141d60=""><strong data-v-d3141d60="">10.1 若用户是未满18周岁的未成年人，应在监护人监护、指导并获得监护人同意情况下认真阅读本协议后，方可使用本平台服务。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">10.2 平台重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识并谨慎对待，并在监护人指导时正确使用本平台服务。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">10.3 未成年用户理解如因你违反法律法规、本协议内容，则你及你的监护人应依照法律规定承担因此而可能引起的全部法律责任。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">10.4.1 青少年使用本服务应该在其监护人的监督指导下，在合理范围内正确学习使用网络，避免沉迷虚拟的网络空间，养成良好上网习惯。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">10.4.2 青少年用户必须遵守《全国青少年网络文明公约》：</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">（1）要善于网上学习，不浏览不良信息；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">（2）要诚实友好交流，不侮辱欺诈他人；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">（3）要增强自护意识，不随意约会网友；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">（4）要维护网络安全，不破坏网络秩序；</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">（5）要有益身心健康，不沉溺虚拟时空。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">为更好的保护未成年人隐私权益，平台提醒用户慎重发布包含未成年人素材的内容，一经发布，即视为用户同意本服务展示未成年人的信息、肖像、声音等，且允许平台依据本协议使用、处理该等与未成年人相关的内容。</strong></p><h4 data-v-d3141d60=""> 11、其他</h4><p data-v-d3141d60=""><strong data-v-d3141d60="">11.1 本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国大陆地区法律。倘本协议之任何规定因与中华人民共和国的法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">11.2 本协议的签订地为中华人民共和国北京市，若您因本协议与公司发生争议的，双方应尽量友好协商解决，协商不成，您同意应将争议提交至本平台注册主体住所地人民法院管辖。</strong></p><p data-v-d3141d60=""><strong data-v-d3141d60="">11.3 为给你提供更好的服务或国家法律法规、政策调整，平台服务将不时更新与变化，我们会适时对本协议进行修订，这些修订构成本协议的一部分。本协议更新后，我们会在更新后的条款生效前通过官方网站（http://www.nowcheck.cn）公告或其他适当的方式提醒你更新的内容，以便你及时了解本协议的最新版本。如你继续使用本平台的服务，表示同意接受修订后的本协议的内容。</strong></p><p data-v-d3141d60="">11.4 本协议中的标题仅为方便及阅读而设，并不影响本协议中任何规定的含义或解释。</p><p data-v-d3141d60="">11.5 您和平台均是独立的主体，在任何情况下本协议不构成平台对用户的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。</p><strong data-v-d3141d60=""></strong></div></div>
""";

  /// 隐私协议
  static const String PRIVACY_AGREEMENT = """
<div id="app"><div data-v-4e121b14="" class="content"><h3 data-v-4e121b14="" class="title" style="text-align:center">慧眼查隐私政策</h3><p data-v-4e121b14="">更新日期: 2022年6月21日</p><p data-v-4e121b14="">生效日期: 2022年6月21日</p><p data-v-4e121b14="">慧眼查（北京）数据科技有限公司(办公地址: 北京市海淀区万柳亿城中心C2座904号。联系方式: 18513834798) 运营的慧眼查(以下或称“我们”)<strong data-v-4e121b14="">注重保护用户个人信息及个人隐私，</strong>您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用慧眼查的所有相关服务(包括但不限于网络资讯、网络社交等，以下称“慧眼查服务”或“服务”)时,我们如何收集、使用、存储、分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。其中，<strong data-v-4e121b14="">有关您个人信息权益的条款等重要内容我们已用加粗形式提示，请特别关注。如果您不同意本隐私政策的任何内容,您可以选择停止使用慧眼查服务;当您使用或继续使用我们的服务,即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。</strong>如对本《隐私政策》或相关事宜有任何问题，请通过huiyancha2021@163.com与我们联系。 </p><p data-v-4e121b14="">目录</p><p data-v-4e121b14="">一、我们如何收集和使用个人信息</p><p data-v-4e121b14="">二、我们如何使用cookie</p><p data-v-4e121b14="">三、我们如何储存和保护个人信息</p><p data-v-4e121b14="">四、我们如何共享、转让、公开披露个人信息</p><p data-v-4e121b14="">五、如何管理您的个人信息</p><p data-v-4e121b14="">六、未成年人信息保护条款</p><p data-v-4e121b14="">七、《隐私政策》 的修订和通知</p><p data-v-4e121b14="">八、联系我们</p><h4 data-v-4e121b14="">一、我们如何收集和使用个人信息</h4><p data-v-4e121b14="">根据《信息安全技术个人信息安全规范》(GB/T 35273- -2017) ，个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的 <strong data-v-4e121b14="">个人信息包括:基本信息(包括个人电话号码、昵称) ;网络身份标识信息(包括系统账号、IP地址) ;个人上网记录(包括登录记录、浏览记录) ;个人常用设备信息(包括硬件型号、操作系统类型、软件列表唯一设备识别码如IMEl/android ID/IDFA在内的描述个人常用设备基本情况的信息) ;个人位置信息(包括精准定位信息等) ;</strong></p><p data-v-4e121b14="">个人敏感信息是指：一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息，本隐私政策中涉及的 <strong data-v-4e121b14=""> 个人敏感信息包括:网络身份识别信息(包括账户名、账户昵称、用户头像、与前述有关的密码) ;其他信息(包括个人电话号码、浏览记录、精准定位信息)。</strong></p><p data-v-4e121b14="">1.注册、登录</p><p data-v-4e121b14=""> 1.1当您注册、登录慧眼查及相关服务时，<strong data-v-4e121b14="">您可以通过手机号创建账号,并且您可以完善相关的网络身份识别信息(头像、昵称、密码)，收集这些信息是为了帮助您完成注册。您还可以根据自身需求选择填写个人介绍、昵称等信息来完善您的信息。</strong></p><p data-v-4e121b14="">1.2您也可以使用第三方账号登录并使用，<strong data-v-4e121b14="">您将授权我们获取您在第三方平台注册的公开信息(头像、昵称以及您授权的其他信息)，用于与慧眼查账号绑定，使您可以直接登录并使用本产品和相关服务。</strong></p><p data-v-4e121b14="">2.资讯浏览</p><p data-v-4e121b14=""><strong data-v-4e121b14="">2.1用于信息展示的日志信息包括:</strong></p><p data-v-4e121b14=""><strong data-v-4e121b14="">您操作、使用的行为信息:点击、关注、收藏、搜索、浏览、分享</strong></p><p data-v-4e121b14=""><strong data-v-4e121b14="">您主动提供的信息:反馈、发布、点赞、评论</strong></p><p data-v-4e121b14=""><strong data-v-4e121b14="">地理位置信息: GPS信息等传感器信息</strong></p><p data-v-4e121b14=""><strong data-v-4e121b14="">2.2GPS地理位置是敏感个人信息，若您拒绝提供，我们将不会根据GPS信息向您推荐信息，且不会影响慧眼查其他功能的正常使用。</strong></p><p data-v-4e121b14="">2.3我们收集、使用的上述信息进行了去标识化处理，数据分析仅对应特定的、无法直接关联您身份的编码，不会与您的真实身份相关联。</p><p data-v-4e121b14="">3.发布与互动</p><p data-v-4e121b14="">3.1信息发布</p><p data-v-4e121b14="">a.您发布内容、评论、提问或回答时，<strong data-v-4e121b14="">我们将收集您发布的信息，并展示您的昵称、头像、发布内容。</strong></p><p data-v-4e121b14="">b.您使用上传图片功能时，我们会请求您授权相机、照片、麦克风权限。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用慧眼查的其他功能。</p><p data-v-4e121b14="">c.用户因使用我们的产品或者服务而被我们收集的信息，例如其他用户发布的信息中可能含有您的部分信息(如:在评论、留言中涉及到与您相关的信息)。</p><p data-v-4e121b14="">3.2互动交流</p><p data-v-4e121b14="">a.您主动关注您感兴趣的账号、话题并与之进行互动，进行浏览、评论、收藏、点赞或分享内容时，我们会收集您关注的账号，并向您展示您关注账号发布内容。</p><p data-v-4e121b14="">4.搜索</p><p data-v-4e121b14=""><strong data-v-4e121b14="">您使用慧眼查的搜索服务时，我们会收集您的搜索关键字信息、日志记录。</strong>为了提供高效的搜索服务，部分前述信息会暂时存储在您的本地存储设备之中，并可向您展示搜索结果内容、搜索历史记录。</p><p data-v-4e121b14="">5.安全运行</p><p data-v-4e121b14="">5.1安全保障功能</p><p data-v-4e121b14="">我们致力于为您提供安全、可信的产品与使用环境，提供优质而可靠的服务是我们的核心目标。为实现安全保障功能所收集的信息是必要信息。</p><p data-v-4e121b14="">5.2设备信息与日志信息</p><p data-v-4e121b14="">a.为了保障软件与服务的安全运行，我们会收集您的硬件型号、操作系统版本号、国际移动设备识别码、唯一设备标识符、 网络设备硬件地址、IP 地址、软件版本号、网络接入方式、类型、状态、网络质量数据、操作、使用、服务日志。</p><p data-v-4e121b14="">b.为了预防恶意程序及安全运营所必需,我们会收集安装的应用信息或正在运行的进程信息、应用程序的总体运行、使用情况与频率、应用崩溃情况、总体安装使用情况、性能数据、应用来源。</p><p data-v-4e121b14="">c.我们可能使用您的账户信息、设备信息、服务日志信息以及我们关联公司、合作方在获得您授权或依法可以共享的信息，用于判断账户安全、进行身份验证、检测及防范安全事件。</p><p data-v-4e121b14="">6.第三方及关联方SDK目录</p><p data-v-4e121b14="">a.为保障慧眼查App相关功能的实现与应用安全稳定的运行，我们可能会接入由第三方及关联方提供的软件开发包（SDK）实现相关目的。</p><p data-v-4e121b14="">b.我们会对获取信息的软件工具开发包（SDK）进行严格的安全监测，以保护数据安全。</p><p data-v-4e121b14="">c.我们对接入的相关SDK在目录中列表。</p><p data-v-4e121b14="">d.请注意，第三方及关联方SDK可能因为其版本升级、策略调整等原因导致数据处理类型存在一定变化，请以其公示的官方说明为准。</p><p data-v-4e121b14="">第三方SDK列表</p><p data-v-4e121b14="">·暂无</p><h4 data-v-4e121b14="">二、我们如何使用cookie</h4><p data-v-4e121b14="">我们可能通过cookies和同类技术收集和使用您的信息，并将该等信息储存为日志信息，并用于以下用途:</p><p data-v-4e121b14="">1.记住您的身份。例如: cookies有 助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息;</p><p data-v-4e121b14="">2.分析您使用我们服务的情况。例如，我们可利用cookies来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎;</p><h4 data-v-4e121b14="">三、我们如何储存和保护个人信息</h4><p data-v-4e121b14="">1、信息存储的地域</p><p data-v-4e121b14=""><strong data-v-4e121b14="">1.1我们会按照法律法规规定,将境内收集的用户个人信息存储于中国境内。</strong></p><p data-v-4e121b14="">1.2目前我们不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我们会向您告知信息出境的目的、接收方、安全保证措施和安全风险，并征得您的同意。</p><p data-v-4e121b14="">2、信息存储的方式和期限</p><p data-v-4e121b14="">2.1我们会通过安全的方式存储您的信息,包括本地存储(例如利用APP进行数据缓存)、位于服务器上的数据库和服务器日志。</p><p data-v-4e121b14="">2.2一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。</p><p data-v-4e121b14="">2.3一般情况下，对于超期信息的处理我们采用服务器自动覆盖方式。</p><p data-v-4e121b14="">3.我们使用行业通用的安全技术、匿名化处理，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术(如SSL) 来保护您提供的个人信息。4.尽管已经采取了合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安.全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。</p><h4 data-v-4e121b14="">四、我们如何共享、转让、公开披露个人信息</h4><p data-v-4e121b14="">1、我们不会与我们以外的任何公司、组织和个人共享您的个人信息，但以下情况除外:</p><p data-v-4e121b14="">(1) 事先获得您明确的同意或授权;</p><p data-v-4e121b14="">(2)根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供;</p><p data-v-4e121b14="">(3)在法律法规允许的范围内，为遵守适用的法律法规、维护社会公共利益、或保护我们或我们的集团公司、我们的客户、其他用户或雇员的人身和财产安全或合法权益或安全免遭损害而所合理必需的;</p><p data-v-4e121b14="">(4) 只有共享您的信息，才能实现我们的产品与/或服务的核心功能或提供您需要的服务; </p><p data-v-4e121b14="">(5)应您需求为您处理您与他人的纠纷或争议;</p><p data-v-4e121b14="">(6)符合与您签署的相关协议(包括在线签署的电子协议以及相应的平台规则)或其他的法律文件约定所提供;</p><p data-v-4e121b14="">(7)基于学术研究而使用;</p><p data-v-4e121b14="">(8)基于符合法律法规的社会公共利益而使用。</p><p data-v-4e121b14="">2、转让</p><p data-v-4e121b14="">我们不会将您的个人信息转让给任何公司、组织和个人,但以下情况除外:</p><p data-v-4e121b14="">(1)事先获得您的明确同意;</p><p data-v-4e121b14="">(2)根据法律法规或强制性的行政或司法要求;</p><p data-v-4e121b14="">(3)在涉及资产转让、收购、兼并、重组或破产清算时，如涉及到个人信息转让，我们会向您告知有关情况，并要求新的持有您个人信息的公司、组织继续受本政策的约束。如变更个人信息使用目的时，我们将要求该公司、组织重新取得您的明确同意。</p><p data-v-4e121b14="">3、公开披露</p><p data-v-4e121b14="">除对违规账号、欺诈行为进行处罚公告时，我们会披露相关账号的信息外，原则上我们不会将您的信息进行公开披露。如确需公开披露时，我们会向您告知公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明确同意</p><p data-v-4e121b14="">4、依法豁免征得同意共享、转让、公开披露的个人信息请您理解，在下列情形中，根据法律法规及国家标准，我们共享、转让、公开披露您的个人信息无需征得您的授权同意:</p><p data-v-4e121b14="">(1)与国家安全、国防安全直接相关的;</p><p data-v-4e121b14="">(2)与公共安全、公共卫生、重大公共利益直接相关的;</p><p data-v-4e121b14="">(3)与犯罪侦查、起诉、审判和判决执行等直接相关的;</p><p data-v-4e121b14="">(4)出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的;</p><p data-v-4e121b14="">(5)您自行向社会公众公开的个人信息;</p><p data-v-4e121b14="">(6)从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p><h4 data-v-4e121b14="">五、如何管理您的个人信息</h4><p data-v-4e121b14="">为了让您更便捷地查询访问、更正您的个人信息，同时保障您退出登录和注销账户的权利，按照中国相关法律、法规、标准，我们在产品设计中为您提供了相应的操作设置，您可参考下面的指引进行操作。</p><p data-v-4e121b14="">1、访问您的个人信息</p><p data-v-4e121b14="">已登录状态下，在客户端中选择右下角的[我的] tab, 此时页面上方会显示您的头像，昵称等个人信息。</p><p data-v-4e121b14="">2、更正您的个人信息</p><p data-v-4e121b14="">已登录状态下，在客户端中选择右下角的[我的]tab,点击页面上方会显示您的头像，昵称等个人信息区域，进入个人主页。再次点击[昵称]，[更换手机号]，即可更正您的个人信息。</p><p data-v-4e121b14="">3、退出登录</p><p data-v-4e121b14="">已登录状态下，在客户端中选择右下角的[我的] tab, 进入[设置]。拉到最底部，会看到[退出登录]按钮，点击即可。</p><p data-v-4e121b14="">4、注销</p><p data-v-4e121b14="">已登录状态下，在客户端中选择右下角的[我的] tab, 进入[设置]。拉到最底部，会看到[注销账号]按钮，点击即可。</p><h4 data-v-4e121b14="">六、未成年人信息保护条款</h4><p data-v-4e121b14=""><strong data-v-4e121b14="">若你是未满18周岁的未成年人，在使用慧眼查相关服务前，应在你的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。</strong> 我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、储存、共享、转让或披露未成年人的个人信息。</p><h4 data-v-4e121b14="">七、《隐私政策》 的修订和通知</h4><p data-v-4e121b14="">给您提供更好的服务，慧眼查及相关服务将不时更新与变化，我们会适时修订本隐私政策的条款，该等修订构成本隐私政策的一部分。</p><p data-v-4e121b14="">当本隐私政策更新后，我们会在慧眼查发出更新版本，并在更新后的条款生效前以站内信等适当的方式提醒您相关内容的更新,以便您及时了解本隐私政策的最新版本。</p><h4 data-v-4e121b14="">八、联系我们</h4><p data-v-4e121b14="">当您有其他的投诉、建议、未成年人个人信息相关问题或需要删除所有访问记录时，请通过18513834798与我们联系。您也可以将您的问题发送至huiyancha2021@163.com或寄到如下地址: 北京市海淀区万柳亿城中心C2座904号 前台收 邮编: 100000。</p><p data-v-4e121b14="">我们将尽快审核所涉问题，并在验证您的用户身份后的十五天内予以回复。</p></div></div>
""";
}
